{
    "1": [
        "Joel 2:25\nThen I will make up for you the years that the swarming locust has eaten, the creeping locust, the stripping locust, and the gnawing locust",
        "Jeremiah 29:11-14\nFor I know the plans that I have for you,’ declares the Lord, ‘plans for prosperity and not for disaster, to give you a future and a hope.\nThen you will call upon Me and come and pray to Me, and I will listen to you.\nAnd you will seek Me and find Me when you search for Me with all your heart.\nI will let Myself be found by you,’ declares the Lord, ‘and I will restore your fortunes and gather you from all the nations and all the places where I have driven you,’ declares the Lord, ‘and I will bring you back to the place from where I sent you into exile.’",
        "Hebrews 10:23\nLet’s hold firmly to the confession of our hope without wavering, for He who promised is faithful.",
        "Isaiah 40:28-31\nDo you not know? Have you not heard?\nThe Everlasting God, the Lord, the Creator of the ends of the earth Does not become weary or tired.\nHis understanding is unsearchable.\nHe gives strength to the weary, And to the one who lacks might He increases power.\nThough youths grow weary and tired, And vigorous young men stumble badly,\nYet those who wait for the Lord Will gain new strength; They will mount up with wings like eagles, They will run and not get tired, They will walk and not become weary.",
        "Romans 8:24-25\nFor in hope we have been saved, but hope that is seen is not hope; for who hopes for what he already sees?\nBut if we hope for what we do not see, through perseverance we wait eagerly for it.",
        "Psalm 33:18-22\nBehold, the eye of the Lord is on those who fear Him, On those who wait for His faithfulness,\nTo rescue their soul from death And to keep them alive in famine.\nOur soul waits for the Lord; He is our help and our shield.\nFor our heart rejoices in Him, Because we trust in His holy name.\nLet Your favor, Lord, be upon us, Just as we have waited for You.",
        "Romans 15:13\nNow may the God of hope fill you with all joy and peace in believing, so that you will abound in hope by the power of the Holy Spirit.",
        "Romans 5:1-5\nTherefore, having been justified by faith, we have peace with God through our Lord Jesus Christ,\nthrough whom we also have obtained our introduction by faith into this grace in which we stand; and we celebrate in hope of the glory of God.\nAnd not only this, but we also celebrate in our tribulations, knowing that tribulation brings about perseverance;\nand perseverance, proven character; and proven character, hope;\nand hope does not disappoint, because the love of God has been poured out within our hearts through the Holy Spirit who was given to us."
    ],
    "2": [
        "Psalm 139:5-6\nYou have encircled me behind and in front, And placed Your hand upon me.\nSuch knowledge is too wonderful for me; It is too high, I cannot comprehend it.",
        "John 15:9\nJust as the Father has loved Me, I also have loved you; remain in My love.",
        "I John 3:1\nSee how great a love the Father has given us, that we would be called children of God; and in fact we are.",
        "Psalm 18:19\nHe brought me out into a spacious place; He rescued me because He delighted in me.",
        "Isaiah 54:10\n\"Though the mountains be shaken and the hills be removed, yet My unfailing love for you will not be shaken nor My covenant of peace be removed,” says the Lord, who has compassion on you.",
        "Psalm 103:11\nFor as high as the heavens are above the earth, so great is his love for those who fear him;",
        "Romans 8:37-39\nBut in all these things we overwhelmingly conquer through Him who loved us.\nFor I am convinced that neither death, nor life, nor angels, nor principalities, nor things present, nor things to come, nor powers, nor height, nor depth, nor any other created thing will be able to separate us from the love of God that is in Christ Jesus our Lord.",
        "Isaiah 43:4\nSince you are precious in My sight, Since you are honored and I love you, I will give other people in your place and other nations in exchange for your life."
    ],
    "3": [
        "I John 5:14-15\nThis is the confidence which we have before Him, that, if we ask anything according to His will, He hears us.\nAnd if we know that He hears us in whatever we ask, we know that we have the requests which we have asked from Him.",
        "Matthew 21:21-22\nAnd Jesus answered and said to them, “Truly I say to you, if you have faith and do not doubt, you will not only do what was done to the fig tree, but even if you say to this mountain, ‘Be taken up and cast into the sea,’ it will happen.\nAnd whatever you ask in prayer, believing, you will receive it all.”",
        "John 15:7-8\nIf you remain in me and my words remain in you, ask whatever you wish, and it will be done for you.\nThis is to my Father’s glory, that you bear much fruit, showing yourselves to be my disciples.",
        "Matt 7:7-11\nAsk, and it will be given to you; seek, and you will find; knock, and it will be opened to you.\nFor everyone who asks receives, and the one who seeks finds, and to the one who knocks it will be opened.\nOr what person is there among you who, when his son asks for a loaf of bread, will give him a stone?\nOr if he asks for a fish, he will not give him a snake?\nSo if you, despite being evil, know how to give good gifts to your children, how much more will your Father who is in heaven give good things to those who ask Him!",
        "James 1:5-8\nBut if any of you lacks wisdom, let him ask of God, who gives to all generously and without reproach, and it will be given to him.\nBut he must ask in faith without any doubting, for the one who doubts is like the surf of the sea, driven and tossed by the wind.\nFor that person ought not to expect that he will receive anything from the Lord,\nbeing a double-minded man, unstable in all his ways.",
        "Phillipians 4:6-7\nDo not be anxious about anything, but in everything by prayer and pleading with thanksgiving let your requests be made known to God.\nAnd the peace of God, which surpasses all comprehension, will guard your hearts and minds in Christ Jesus.",
        "Luke 18:1-7\nNow He was telling them a parable to show that at all times they ought to pray and not become discouraged, saying, “In a certain city there was a judge who did not fear God and did not respect any person.\nNow there was a widow in that city, and she kept coming to him, saying, ‘Give me justice against my opponent.’ For a while he was unwilling; but later he said to himself, ‘Even though I do not fear God nor respect any person,\nyet because this widow is bothering me, I will give her justice; otherwise by continually coming she will wear me out.’” And the Lord said, “Listen to what the unrighteous judge *said;\nnow, will God not bring about justice for His elect who cry out to Him day and night, and will He delay long for them?",
        "James 5:16-18\nTherefore, confess your sins to one another, and pray for one another so that you may be healed. A prayer of a righteous person, when it is brought about, can accomplish much.\nElijah was a man with a nature like ours, and he prayed earnestly that it would not rain, and it did not rain on the earth for three years and six months.\nThen he prayed again, and the sky poured rain and the earth produced its fruit.",
        "Mark 9:23-24\nBut Jesus said to him, “‘If You can?’ All things are possible for the one who believes.”\nImmediately the boy’s father cried out and said, “I do believe; help my unbelief!”",
        "Proverbs 15:29\nThe Lord is far from the wicked, but he hears the prayer of the righteous.",
        "Hebrews 11:6\nAnd without faith it is impossible to please God, because anyone who comes to him must believe that he exists and that he rewards those who earnestly seek him.",
        "I Thessalonians 5:16-18\nRejoice always, pray continually, give thanks in all circumstances; for this is God’s will for you in Christ Jesus.",
        "Hebrews 4:16\nLet us then with confidence draw near to the throne of grace, that we may receive mercy and find grace to help in time of need.",
        "Jeremiah 29:12-14\nThen you will call upon Me and come and pray to Me, and I will listen to you.\nAnd you will seek Me and find Me when you search for Me with all your heart.\nI will let Myself be found by you, declares the Lord",
        "Psalm 102:17\nHe regards the prayer of the destitute and does not despise their prayer.",
        "Psalm 145:18\nThe Lord is near to all who call on him, to all who call on him in truth.",
        "Psalm 34:17\nWhen the righteous cry for help, the Lord hears and delivers them out of all their troubles.",
        "II Peter 3:8-9\nBut do not let this one fact escape your notice, beloved, that with the Lord one day is like a thousand years, and a thousand years like one day.\nThe Lord is not slow about His promise, as some count slowness, but is patient toward you, not willing for any to perish, but for all to come to repentance."
    ]
}