{
    "1": [
      {
        "reference": "Joel 2:25",
        "verses": "Then I will make up for you the years that the swarming locust has eaten, the creeping locust, the stripping locust, and the gnawing locust"
      },
      {
        "reference": "Jeremiah 29:11-14",
        "verses": "For I know the plans that I have for you, declares the Lord, plans for prosperity and not for disaster, to give you a future and a hope. Then you will call upon Me and come and pray to Me, and I will listen to you. And you will seek Me and find Me when you search for Me with all your heart. I will let Myself be found by you, declares the Lord, and I will restore your fortunes and gather you from all the nations and all the places where I have driven you, declares the Lord, and I will bring you back to the place from where I sent you into exile."
      },
      {
        "reference": "Hebrews 10:23",
        "verses": "Let's hold firmly to the confession of our hope without wavering, for He who promised is faithful."
      },
      {
        "reference": "Isaiah 40:28-31",
        "verses": "Do you not know? Have you not heard? \nThe Everlasting God, the Lord, the Creator of the ends of the earth \nDoes not become weary or tired. \nHis understanding is unsearchable. \nHe gives strength to the weary, \nAnd to the one who lacks might He increases power. \nThough youths grow weary and tired, \nAnd vigorous young men stumble badly, \nYet those who wait for the Lord \nWill gain new strength; \nThey will mount up with wings like eagles, \nThey will run and not get tired, \nThey will walk and not become weary. \n"
      },
      {
        "reference": "Romans 8:24-25",
        "verses": " For in hope we have been saved, but hope that is seen is not hope; for who hopes for what he already sees? But if we hope for what we do not see, through perseverance we wait eagerly for it."
      },
      {
        "reference": "Psalm 33:18-22",
        "verses": "Behold, the eye of the Lord is on those who fear Him,\nOn those who wait for His faithfulness,\nTo rescue their soul from death\nAnd to keep them alive in famine.\nOur soul waits for the Lord;\nHe is our help and our shield.\nFor our heart rejoices in Him,\nBecause we trust in His holy name.\nLet Your favor, Lord, be upon us,\nJust as we have waited for You."
      },
      {
        "reference": "Romans 15:13",
        "verses": "Now may the God of hope fill you with all joy and peace in believing, so that you will abound in hope by the power of the Holy Spirit."
      },
      {
        "reference": "Romans 5:1-5",
        "verses": "Therefore, having been justified by faith, we have peace with God through our Lord Jesus Christ, through whom we also have obtained our introduction by faith into this grace in which we stand; and we celebrate in hope of the glory of God. And not only this, but we also celebrate in our tribulations, knowing that tribulation brings about perseverance; and perseverance, proven character; and proven character, hope; and hope does not disappoint, because the love of God has been poured out within our hearts through the Holy Spirit who was given to us."
      }
    ],
    "2": [
      {
        "reference": "Psalm 139:1-6",
        "verses": "Lord, You have searched me and known me.\nYou know when I sit down and when I get up;\nYou understand my thought from far away.\nYou scrutinize my path and my lying down,\nAnd are acquainted with all my ways.\nEven before there is a word on my tongue,\nBehold, Lord, You know it all.\nYou have encircled me behind and in front,\nAnd placed Your hand upon me.\nSuch knowledge is too wonderful for me;\nIt is too high, I cannot comprehend it."
      },
      {
        "reference": "John 15:9",
        "verses": "Just as the Father has loved Me, I also have loved you; remain in My love."
      },
      {
        "reference": "I John 3:1",
        "verses": "See how great a love the Father has given us, that we would be called children of God; and in fact we are."
      },
      {
        "reference": "Psalm 18:18-19",
        "verses": "They confronted me in the day of my disaster,\nBut the Lord was my support.\nHe also brought me out into an open place;\nHe rescued me, because He delighted in me."
      },
      {
        "reference": "Isaiah 54:10",
        "verses": "For the mountains may be removed and the hills may shake,\nBut My favor will not be removed from you,\nNor will My covenant of peace be shaken,\nSays the Lord who has compassion on you."
      },
      {
        "reference": "Psalm 103:13-14",
        "verses": "Just as a father has compassion on his children,\nSo the Lord has compassion on those who fear Him.\nFor He Himself knows our form;\nHe is mindful that we are nothing but dust."
      },
      {
        "reference": "Romans 8:37-39",
        "verses": " But in all these things we overwhelmingly conquer through Him who loved us. For I am convinced that neither death, nor life, nor angels, nor principalities, nor things present, nor things to come, nor powers, nor height, nor depth, nor any other created thing will be able to separate us from the love of God that is in Christ Jesus our Lord."
      },
      {
        "reference": "Isaiah 43:4",
        "verses": "Since you are precious in My sight,\nSince you are honored and I love you,\nI will give other people in your place and other nations in exchange for your life."
      }

    ],
    "3": [
      {
        "reference": "I John 5:14-15",
        "verses": "This is the confidence which we have before Him, that, if we ask anything according to His will, He hears us. And if we know that He hears us in whatever we ask, we know that we have the requests which we have asked from Him."
      },
      {
        "reference": "Matthew 21:21-22",
        "verses": "And Jesus answered and said to them, “Truly I say to you, if you have faith and do not doubt, you will not only do what was done to the fig tree, but even if you say to this mountain, ‘Be taken up and cast into the sea,’ it will happen. And whatever you ask in prayer, believing, you will receive it all.”"
      },
      {
        "reference": "John 15:7-8",
        "verses": "If you remain in Me, and My words remain in you, ask whatever you wish, and it will be done for you. My Father is glorified by this, that you bear much fruit, and so prove to be My disciples."
      },
      {
        "reference": "Matthew 7:7-11",
        "verses": "Ask, and it will be given to you; seek, and you will find; knock, and it will be opened to you. For everyone who asks receives, and the one who seeks finds, and to the one who knocks it will be opened. Or what person is there among you who, when his son asks for a loaf of bread, will give him a stone? Or if he asks for a fish, he will not give him a snake, will he? So if you, despite being evil, know how to give good gifts to your children, how much more will your Father who is in heaven give good things to those who ask Him!"
      },
      {
        "reference": "James 1:5-8",
        "verses": "But if any of you lacks wisdom, let him ask of God, who gives to all generously and without reproach, and it will be given to him. But he must ask in faith without any doubting, for the one who doubts is like the surf of the sea, driven and tossed by the wind. For that person ought not to expect that he will receive anything from the Lord, being a double-minded man, unstable in all his ways."
      },
      {
        "reference": "Phillipians 4:6-7",
        "verses": "Do not be anxious about anything, but in everything by prayer and pleading with thanksgiving let your requests be made known to God. And the peace of God, which surpasses all comprehension, will guard your hearts and minds in Christ Jesus."
      },
      {
        "reference": "Luke 18:1-7",
        "verses": " Now He was telling them a parable to show that at all times they ought to pray and not become discouraged, saying, “In a certain city there was a judge who did not fear God and did not respect any person. Now there was a widow in that city, and she kept coming to him, saying, ‘Give me justice against my opponent.’ For a while he was unwilling; but later he said to himself, ‘Even though I do not fear God nor respect any person, yet because this widow is bothering me, I will give her justice; otherwise by continually coming she will wear me out.’” And the Lord said, “Listen to what the unrighteous judge said; now, will God not bring about justice for His elect who cry out to Him day and night, and will He delay long for them?"
      },
      {
        "reference": "James 5:13-18",
        "verses": "Is anyone among you suffering? Then he must pray. Is anyone cheerful? He is to sing praises. Is anyone among you sick? Then he must call for the elders of the church and they are to pray over him, anointing him with oil in the name of the Lord; and the prayer of faith will restore the one who is sick, and the Lord will raise him up, and if he has committed sins, they will be forgiven him. Therefore, confess your sins to one another, and pray for one another so that you may be healed. A prayer of a righteous person, when it is brought about, can accomplish much. Elijah was a man with a nature like ours, and he prayed earnestly that it would not rain, and it did not rain on the earth for three years and six months. Then he prayed again, and the sky poured rain and the earth produced its fruit."
      },
      {
        "reference": "Mark 9:23-24",
        "verses": "But Jesus said to him, “‘If You can?’ All things are possible for the one who believes.” Immediately the boy’s father cried out and said, “I do believe; help my unbelief!” "
      },
      {
        "reference": "Proverbs 15:29",
        "verses": "The Lord is far from the wicked, But He hears the prayer of the righteous."
      },
      {
        "reference": "Hebrews 11:6",
        "verses": "And without faith it is impossible to please Him, for the one who comes to God must believe that He exists, and that He proves to be One who rewards those who seek Him."
      },
      {
        "reference": "I Thessalonians 5:16-18",
        "verses": " Rejoice always, pray without ceasing, in everything give thanks; for this is the will of God for you in Christ Jesus. "
      },
      {
        "reference": "Hebrews 4:16",
        "verses": "Therefore let’s approach the throne of grace with confidence, so that we may receive mercy and find grace for help at the time of our need."
      },
      {
        "reference": "Jeremiah 29:12-14",
        "verses": "Then you will call upon Me and come and pray to Me, and I will listen to you. And you will seek Me and find Me when you search for Me with all your heart. I will let Myself be found by you,’ declares the Lord, ‘and I will restore your fortunes and gather you from all the nations and all the places where I have driven you,’ declares the Lord, ‘and I will bring you back to the place from where I sent you into exile.’"
      },
      {
        "reference": "Psalm 102:17",
        "verses": "He has turned His attention to the prayer of the destitute\nAnd has not despised their prayer."
      },
      {
        "reference": "Psalm 145:14-20",
        "verses": "The Lord supports all who fall,\nAnd raises up all who are bowed down.\nThe eyes of all [h]look to You,\nAnd You give them their food in due time.\nYou open Your hand\nAnd satisfy the desire of every living thing.\nThe Lord is righteous in all His ways,\nAnd kind in all His works.\nThe Lord is near to all who call on Him,\nTo all who call on Him in truth.\nHe will fulfill the desire of those who fear Him;\nHe will also hear their cry for help and save them.\nThe Lord watches over all who love Him"
      },
      {
        "reference": "Psalm 34:17-18",
        "verses": "The righteous cry out, and the Lord hears\nAnd rescues them from all their troubles.\nThe Lord is near to the brokenhearted\nAnd saves those who are crushed in spirit."
      },
      {
        "reference": "II Peter 3:8-9",
        "verses": "But do not let this one fact escape your notice, beloved, that with the Lord one day is like a thousand years, and a thousand years like one day. The Lord is not slow about His promise, as some count slowness, but is patient toward you, not willing for any to perish, but for all to come to repentance."
      }

    ],
    "4": [
      {
        "reference": "Psalm 27:13-14",
        "verses": "I would have despaired unless I had believed that I would see the goodness of the Lord\nIn the land of the living.\nWait for the Lord;\nBe strong and let your heart take courage;\nYes, wait for the Lord."
      }
    ],
    "5": [
      {
        "reference": "",
        "verses": "verses coming soon"
      }
    ],
    "6": [
      {
        "reference": "",
        "verses": "verses coming soon"
      }
    ],
    "7": [
      {
        "reference": "",
        "verses": "verses coming soon"
      }
    ]
  }